# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [1]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [ ]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="password")
cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [ ]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="password")
 
cursorObject = connection.cursor()
 
cursorObject.execute("CREATE DATABASE e_commerce")

connection.close()

In [2]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="password",
                                     database = 'e_commerce')
cursorObject = connection.cursor()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR(1),PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`orders`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [ ]:
table_creation_query = """create table supplier (SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
                          create table customer (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30), CUS_GENDER CHAR(1),
                          PRIMARY KEY (CUS_ID)); 
                          create table category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL, PRIMARY KEY (CAT_ID));
                          create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL, 
                          PRIMARY KEY (PRO_ID), FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                          create table product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID), 
                          FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID));
                          create table orders (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL, PRIMARY KEY (ORD_ID), 
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER (CUS_ID), FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS (PROD_ID));
                          create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL, PRIMARY KEY (RAT_ID), FOREIGN KEY (SUPP_ID)
                          REFERENCES SUPPLIER (SUPP_ID), FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER (CUS_ID));"""
cursorObject.execute(table_creation_query)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 2589631470 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [ ]:
# insert into "supplier" table
insert_query = "INSERT INTO SUPPLIER (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
val = [(1,"Rajesh Retails","Delhi",1234567890),
       (2,"Appario Ltd.","Mumbai",2589631470),
       (3,"Knome products","Bangalore",9785462315),
       (4,"Bansal Retails","Kochi",8975463285),
       (5,"Mittal Ltd.","Lucknow",7898456532)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | CUS_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [ ]:
# insert into "customer" table
insert_query = "INSERT INTO CUSTOMER (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1,"AAKASH",9999999999,"Delhi","M"),
       (2,"AMAN",9785463215,"Mumbai","M"),
       (3,"NEHA",9999999998,"Bangalore","F"),
       (4,"MEGHA",9994562399,"Kochi","F"),
       (5,"PULKIT",7895999999,"Lucknow","M")]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [ ]:
# insert into "categoty" table
insert_query = "INSERT INTO category (CAT_ID, CAT_NAME) VALUES (%s, %s)"
val = [(1,"BOOKS"),
       (2,"GAMES"),
       (3,"GROCERIES"),
       (4,"ELECTRONICS"),
       (5,"CLOTHES")]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [ ]:
# insert into "product" table
insert_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]


cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [ ]:
# insert into "product_details" table
insert_query = "INSERT INTO PRODUCT_DETAILS (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [ ]:
# insert into "orders" table
insert_query = "INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [ ]:
# insert into "rating" table
insert_query = "INSERT INTO RATING (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]

cursorObject.executemany(insert_query, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [6]:
Q3= """Select C.CUS_ID,C.CUS_GENDER,Count(*) as NUM_CUST from customer as C inner join orders as O on C.cus_id=O.cus_id
       where O.ord_amount>=3000 group by C.cus_gender"""


cursorObject.execute(Q3)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_GENDER','NUM_CUST'])
output_df

   CUS_ID CUS_GENDER  NUM_CUST
0       5          M         1
1       4          F         1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [5]:
Q4 = """select pro.PRO_NAME, ord.ORD_ID, ord.CUS_ID, ord.ORD_AMOUNT, ord.ORD_DATE from orders ord inner join product_details 
        prod on ord.prod_id = prod.prod_id inner join product pro on pro.pro_id = prod.pro_id where ord.CUS_ID=2"""

cursorObject.execute(Q4)

output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['PRODUCT NAME','ORDER ID', 'CUST ID','ORDER AMOUNT','ORDER DATE'])
output_df

  PRODUCT NAME  ORDER ID  CUST ID  ORDER AMOUNT  ORDER DATE
0        GTA V        50        2          2000  2021-10-06

### Q5) Display the Supplier details who can supply more than one product.

In [7]:
Q5 = """select sup.supp_id,sup.supp_name,sup.supp_city,sup.supp_phone,count(prod.prod_id) total_products from Supplier 
        sup inner join product_details prod on sup.SUPP_ID = prod.supp_id inner join product pro on pro.pro_id=prod.pro_id
        group by sup.supp_id, sup.supp_name, sup.supp_city, sup.supp_phone having count(prod.prod_id) > 1"""

cursorObject.execute(Q5)

output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['SUPP ID', 'SUPP NAME', 'SUPP CITY', 'SUPP PHONE', 'PRODUCTS'])
output_df

   SUPP ID       SUPP NAME SUPP CITY  SUPP PHONE  PRODUCTS
0        1  Rajesh Retails     Delhi  1234567890         2

### Q6) Find the category of the product whose order amount is minimum.

In [3]:
Q6 = """select cat.cat_name from Category cat inner join product pro on cat.cat_id = pro.cat_id inner join product_details 
        prod on pro.pro_id = prod.pro_id where prod.PROD_ID in (select prod_id from orders where ord_amount=(select min(ord_amount) from orders))"""

cursorObject.execute(Q6)

output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['CATEGORY'])
output_df

    CATEGORY
0  GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [4]:
Q7="""select P.PRO_ID,P.PRO_NAME,Q.ORD_DATE from product as P inner join
      (select PD.PRO_ID,B.ORD_DATE FROM product_details as PD inner join
      (select O.ORD_DATE,O.PROD_ID from orders as O where O.ORD_DATE>'2021-10-05') as B where PD.PROD_ID=B.PROD_ID)
      as Q ON P.PRO_ID=Q.PRO_ID"""

cursorObject.execute(Q7)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['PRODUCT ID','PRODUCT NAME','ORDER DATE'])
output_df

   PRODUCT ID PRODUCT NAME  ORDER DATE
0           4         OATS  2021-10-12
1           1        GTA V  2021-10-06

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [5]:
Q8="""select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars from rating inner join supplier on
      rating.supp_id=supplier.supp_id inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""

cursorObject.execute(Q8)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP ID','SUPP NAME','CUSTOMER NAME','RATINGS'])
output_df

   SUPP ID       SUPP NAME CUSTOMER NAME  RATINGS
0        1  Rajesh Retails        PULKIT        5
1        2    Appario Ltd.          AMAN        4
2        5     Mittal Ltd.         MEGHA        4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [6]:
Q9="select CUS_NAME,CUS_GENDER FROM customer where CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'"

cursorObject.execute(Q9)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['CUSTOMER NAME','CUSTOMER GENDER'])
output_df

  CUSTOMER NAME CUSTOMER GENDER
0        AAKASH               M
1          AMAN               M
2          NEHA               F
3         MEGHA               F

### Q10) Display the total order amount of the male customers.

In [7]:
Q10="""select sum(orders.ord_amount) as Amount from orders inner join customer on orders.cus_id=customer.cus_id where customer.cus_gender='M';"""

cursorObject.execute(Q10)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['TOTAL AMOUNT'])
output_df

  TOTAL AMOUNT
0        34500

### Q11) Display all the Customers left outer join with  the orders

In [ ]:
Q11="""select CUS.CUS_ID, CUS.CUS_NAME, CUS.CUS_GENDER, CUS.CUS_CITY, CUS.CUS_PHONE from customer as CUS left join orders as ORD on ORD.CUS_ID=CUS.CUS_ID"""

cursorObject.execute(Q11)
 
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['ID','NAME','GENDER','CITY','PHONE'])
output_df

   ID    NAME GENDER       CITY       PHONE
0   1  AAKASH      M      Delhi  9999999999
1   2    AMAN      M     Mumbai  9785463215
2   3    NEHA      F  Bangalore  9999999998
3   4   MEGHA      F      Kochi  9994562399
4   5  PULKIT      M    Lucknow  7895999999

In [8]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)